// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль


// let numbers = [1, 2, 3, 4, 5], strings = ['1', '2', '3', '4', '5'], all = [true, 1, 'two', 3, false];
// for (let i = 0; i < 5; i++) {
//     console.log(numbers[i]);
//     if (i === 4) {
//         for (let i = 0; i < 5; i++) {
//             console.log(strings[i]);
//             if (i === 4) {
//                 for (let i = 0; i < 5; i++) {
//                     console.log(all[i]);
//                 }
//             }
//         }
//     }
// }
// //
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// let arr = [];
// for(let i = 0; i < 5; i++){
//     arr[i]=Math.random();
// }
// for(let i = 0; i < 5; i++){
//     console.log(arr[i]);
// }
//
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//
// for(let i = 0; i < 10; i++){
//     document.write(`<div>===========</div>`);
//     document.write(`<div>${i} (-(-_(-_-)_-)-)</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

let i = 0;
while (i < 10){
    document.write(`<h1>------------------------</h1>`);
    document.write(`<h1>${i} Hello OKTEN</h1>`);
    i++;
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    strings = ['1', '2', '3', '4', '5','6','7','8','9','10'],
    bang = [true, 1, 'two', 3, false, 6, 7, 8, 9, 'ten'];
for (let i = 0; i < 10; i++) {
    console.log(numbers[i]);
    if (i === 9) {
        for (let i = 0; i < 10; i++) {
            console.log(strings[i]);
            if (i === 9) {
                for (let i = 0; i < 10; i++) {
                    console.log(bang[i]);
                }
            }
        }
    }
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let oh = [213,'kurwa',true,'ja', 100500, 65,'pierdole', 8908,123,false];

for (let i = 0; i < 10; i++) {
    if(typeof oh[i] === "number"){
        console.log(oh[i]);
    }
}
for (let i = 0; i < 10; i++) {
    if(typeof oh[i] === "boolean"){
        console.log(oh[i]);
    }
}

for (let ho of oh) {
    if(typeof ho === "string"){
        console.log(ho);
    }
}
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
//   Вивести в консоль всі його елементи в циклі.

for (let i = 0; i < 10; i++) {
    console.log(oh[i]);
}

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for(let i = 0 ; i < 10;i++){
    console.log(i);
    document.write(i);
}
for(let i = 0 ; i< 100;i++){
    console.log(i);
    document.write(i);
}
for(let i = 0 ; i < 100;i+=2){
    console.log(i);
    document.write(i);
}
for(let i = 0 ; i < 100;i++){
    if(i%2===0){
        console.log(i);
        document.write(i);
    }
}
for(let i = 0 ; i < 100;i++){
    if(i%2!==0){
        console.log(i);
        document.write(i);
    }
}