//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому
// 3 і більше елементи. Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if(friends.length >= 3){
//     console.log("масив в якому 3 і більше елементів");
// }else{
//     console.log("це маленький масив, в якому менше 3-х елементів");
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let x=1,y=50,z=100;
// if((x>y && x<z) || (x>z && x<y)){
//     console.log("X in the middle");
// }else if((y>x && y<z) || (y>z && y<x)){
//     console.log("Y in the middle");
// }else if((z>x && z<y) || (z>y && z<x)){
//     console.log("Z in the middle");
// }
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let a=2,b=3;

let result = a + b < 4 ? 'Мало' : 'Багато' ;
console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let n = +prompt("исло выд -100 до 100");
let res = (n>=-100 && n<0) ? 'Число негативне' : (n<=100 && n>0) ? 'Число позитивне' : (n===0) ? 'Це нуль' : 'Хз шо ето';
console.log(res);


