// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає
// число (в першу, другу, третю или четверту частину години).

// let n = +prompt("Впиши число от 0 до 59:");
// if (n<=15 && n>=0){
//     console.log("Попадає в 1 чверть");
// }else if(n<=30 && n>15){
//     console.log("Попадає в 2 чверть");
// }else if(n<=45 && n>30){
//     console.log("Попадає в 3 чверть");
// }else if(n<=59 && n>45){
//     console.log("Попадає в 4 чверть");
// }
//
// // - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// // (у першу, другу чи третю).
// let day = +prompt("Подай день місяця від 1 до 31:")
//
// if (day<=10 && day>=1){
//     console.log("Попадає в 1 половину місяця");
// }else if(day<=20 && day>10){
//     console.log("Попадає в 2 половину місяця");
// }else if(day<=31 && day>20) {
//     console.log("Попадає в 3 половину місяця");
// }
//
// // - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// //     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// // let test = confirm("??")
// // // if(test == true){
// // //     console.log('Вірно');
// // // }else {
// // //     console.log('Неправильно');
// // // }
//
// let test = confirm("??") ? 'Вірно' : 'Неправильно';
// console.log(test);


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
// let a = Math.round(Math.random());
// if (a !== 0){
//  console.log('Вірно');
// }else if (a === 0){
//     console.log('Неправильно');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
// і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt("День тижня:");
// switch (day){
//     case 1:
//         console.log("Робота");
//         console.log("Навчання");
//         console.log("Сон");
//         break;
//     case 2:
//         console.log("Робота");
//         console.log("Навчання");
//         console.log("Сон");
//         break;
//     case 3:
//         console.log("Робота");
//         console.log("Навчання");
//         console.log("Сон");
//         break;
//     case 4:
//         console.log("Робота");
//         console.log("Навчання");
//         console.log("Сон");
//         break;
//     case 5:
//         console.log("Робота");
//         console.log("Навчання");
//         console.log("Сон");
//         break;
//     case 6:
//         console.log("Підготовка до анг");
//         console.log("Англійська");
//         console.log("Практичні завдання");
//         console.log("Сон");
//         break;
//     case 7:
//         console.log("Практика верстка");
//         console.log("Зустріч");
//         console.log("Вертаєм");
//         console.log("Сон");
//         break;
//     default:
//         console.log("Не бреши нема такого дня!!!   (-(-_(-_-)_-)-)  ");
//         break;
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let Year = prompt("Введи рік:");
// if(Number.isInteger(Year/4)){
//     console.log("Високосний");
// }else {
//     console.log("Ні");
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let textView = prompt("Яка «офіційна» назва JavaScript?");
// if(textView === "ECMAScript"){
//     console.log('Правильно!');
// }else {
//     console.log("Не знаєте? ECMAScript!");
// }