// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let x=prompt("Введи перше число"), y=prompt("Введи друге число");
//
// if(x>y){
//     console.log("Число " + x + " максимальне");
// }else if(y>x){
//     console.log("Число " + y + " максимальне");
// }else{
//     console.log("Вони рівні");
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let homeNumber = +prompt("веди номер кварти");
// if(homeNumber<=20 && homeNumber>=1){
//     console.log("Перший під'їзд.");
// }else if(homeNumber<=48 && homeNumber>=21){
//     console.log("Другий під'їзд");
// }else if(homeNumber<=90 && homeNumber>=49){
//     console.log("Третій під'їзд");
// }else{
//     console.log("Ти що тютю (O_o) Немає такої квартири!");
// }

// - Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt("Тільки не 10!");
// if(number===10){
//     console.log("Вірно!");
// }else {
//     console.log("Невірно!");
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = [2,23];
// console.log(typeof x);
// if( typeof x === "number" ){
//     console.log(1);
// }else if(typeof x === "string"){
//     console.log(2);
// }else if(typeof x ==="boolean"){
//     console.log(3);
// }else if(typeof x === "object"){
//     console.log(4);
// }else{
//     console.log("I dont no =(");
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperatura = +prompt("яка температура?");
// if(temperatura<=22 && temperatura>=10){
//     console.log("ми йдемо ВЧИТИСЯ");
// }else{
//     console.log("сидимо вдома і вчимося ОНЛАЙН");
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить
//     тоді  вивести Повідомлення - що число не вірне ... .

let num = +prompt("Введи число від 1 до 5.");

switch (num){
    case 1:
        console.log("Автомобіль.");
        break;
    case 2:
        console.log("Мото.");
        break;
    case 3:
        console.log("Телфон ксяомі.");
        break;
    case 4:
        console.log("IPHONE 13pro.");
        break;
    case 5:
        console.log("Щось класне.");
        break;
    default:
        console.log("не вірне число.")
        break
}